src/main/resources/xml/accommodationSalesServicePort/postPayment/postPayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
	<soapenv:Header/>
	<soapenv:Body>
		<sal:postPayment>
			<paymentRequest>
				<pointsPayments>
					<payingContractSummary>
						<payingContracts>
							<contractId>?</contractId>
							<contractType>?</contractType>
							<paymentSequence>?</paymentSequence>
							<virtualContractId>?</virtualContractId>
							<useYear>?</useYear>
						</payingContracts>
						<pointStateId>?</pointStateId>
						<paymentOrderDetails>
							<fufillmentDate>?</fufillmentDate>
							<currencyType>?</currencyType>
							<value>?</value>
						</paymentOrderDetails>
					</payingContractSummary>
					<totalPointsToCharge>?</totalPointsToCharge>
					<useYear>?</useYear>
				</pointsPayments>
				<membershipId>?</membershipId>
				<inventoryTrackingId>?</inventoryTrackingId>
				<bookAndPay>?</bookAndPay>
				<paymentDescription>?</paymentDescription>
				<overrideCode>?</overrideCode>
				<basicOrderDetails>
					<reservationType>?</reservationType>
					<resortCode>?</resortCode>
					<resortType>?</resortType>
					<reservationNumber>?</reservationNumber>
					<reservationReferenceNo>?</reservationReferenceNo>
					<homeType>?</homeType>
					<arrivalDate>?</arrivalDate>
					<departureDate>?</departureDate>
					<bookingDate>?</bookingDate>
				</basicOrderDetails>
			</paymentRequest>
			<serviceContext>
				<addressRole>?</addressRole>
				<conversationId>?</conversationId>
				<messageId>?</messageId>
				<party1Id>?</party1Id>
				<party1Type>?</party1Type>
				<party2Id>?</party2Id>
				<party2Type>?</party2Type>
				<pathHostName>?</pathHostName>
				<pathId>?</pathId>
				<principalId>?</principalId>
				<principalMethod>?</principalMethod>
				<principalRole>?</principalRole>
				<principalUri>?</principalUri>
				<principalValue>?</principalValue>
				<requestTimeStamp>?</requestTimeStamp>
				<toAddressRole>?</toAddressRole>
				<userName>?</userName>
			</serviceContext>
		</sal:postPayment>
	</soapenv:Body>
</soapenv:Envelope>